OpenFOAM-11/tutorials/incompressibleFluid/ductSecondaryFlow/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.00497 0 0 0.00497 0 0.00497);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottomWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    leftWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
